Tutorials-3.0.1/waveTube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0 	0.0 	0.0)	//0
    (10. 	0.0 	0.0)	//1
    (10. 	0.1 	0.0)	//2
    (0.0 	0.1 	0.0)	//3
    (0.0 	0.0 	0.1)	//4
    (10.	0.0 	0.1)	//5
    (10. 	0.1 	0.1)	//6
    (0.0 	0.1 	0.1)	//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topAndBottom
    {
        type empty;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    sphere
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    free
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
