Tutorials-3.0.1/waveTube/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseMixingCentralDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.05; //0.05;

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval   1e-3; //1e-3; //1e-8; //1e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.5;

maxDeltaT       1e-6; //0.5e-5;

CourantType	faceCourant;

libs ("libcompressibleTools.so");

functions
{
	#include "probeControl"
}

// ************************************************************************* //
