Tutorials-3.0.1/waveTube/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

diffusiveAdvScheme upwind;
defaultAdvScheme vanLeer;
//defaultAdvScheme Minmod;
//defaultAdvScheme upwind;



divSchemes
{
    default		none;

    div(phi,Y.Liq)	Gauss $defaultAdvScheme;

    div(phiNeg,K)	Gauss $defaultAdvScheme;
    div(phiPos,K)	Gauss $defaultAdvScheme;
    div(phi,K)          Gauss $defaultAdvScheme;

    div(phiNeg,h)	Gauss $defaultAdvScheme;
    div(phiPos,h)	Gauss $defaultAdvScheme;

    div(phiNeg,U)	Gauss $defaultAdvScheme;
    div(phiPos,U)	Gauss $defaultAdvScheme;

    div(phid_pos,p)	Gauss $defaultAdvScheme;
    div(phid_neg,p)	Gauss $defaultAdvScheme;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(alphaEff*hi,grad(Yi)) Gauss linear;
    
    div(phi,omega)	Gauss $defaultAdvScheme;
    div(phi,k)		Gauss $defaultAdvScheme;
    
    div(rhoi*Uri,hi)    Gauss linear;
    
    div(gasDiffusionFlux,U) Gauss $defaultAdvScheme;
    div(liqDiffusionFlux,U) Gauss $defaultAdvScheme;
    
    div((-devRhoReff&U)) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         none;

    /*
     *	Interpolations that are critical for KT scheme
     */
    
    
    reconstruct(p)		$defaultAdvScheme;
    reconstruct(YbarLiq)	$defaultAdvScheme;

    reconstruct(rho)		$defaultAdvScheme;
    reconstruct(U)		$defaultAdvScheme;
    reconstruct(psi)		linear;
    reconstruct(c)              $defaultAdvScheme;

    reconstruct(Dp)		$defaultAdvScheme;
    reconstruct(rhoHat)		$defaultAdvScheme;
    
    
    /*
    reconstruct(p)		linear;
    reconstruct(YbarLiq)	linear;

    reconstruct(rho)		linear;
    reconstruct(U)		linear;
    reconstruct(psi)		linear;

    reconstruct(Dp)		linear;
    reconstruct(rhoHat)		linear;
    */
    

    interpolate(muEff) linear;
    interpolate((muEff|Sc)) linear;
    interpolate(rho) linear;
    interpolate(((rho*nut)+thermo:mu)) linear;
    interpolate((((rho*nut)+thermo:mu)|Sc)) linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
    Y.Liq;
    h;
}

wallDist
{
    method	meshWave;
}


// ************************************************************************* //
